## Manipulating the Dataframes

#### Write a program to select the rows, where the sales are greater than 60000 for Mumbai location

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],

'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],

'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

In [30]:
import pandas as pd
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],

'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune', 'Mumbai', 'Pune'],

'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000] })


df_store[(df_store.Sales>60000)]

  Store   Location  Sales
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

-------------------

#### 2. Write a program to replace the â€˜Store' column, contains the values 'A', 'B', 'C', and 'D' with 'Store_A', Store_B', 'Store_C' and 'Store_D' respectively

In [31]:
df_store["NewStore"] = "Store_" + df_store["Store"]
df_store.Store = df_store.NewStore

In [32]:
df_store = df_store.drop(['NewStore'], axis=1)
df_store

     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45600
2  Store_A  Hyderabad  56000
3  Store_C     Mumbai  90000
4  Store_D       Pune  89000
5  Store_A      Delhi  87000
6  Store_D  Hyderabad  85000
7  Store_A       Pune  78000
8  Store_C     Mumbai  89000
9  Store_B       Pune  70000

In [42]:
series_a = pd.Series([1,2,3,4])
series_b = pd.Series([5,6,7])
print(series_a , series_b)
c = pd.concat([series_a , series_b])
print(c)
c[2]

c = pd.concat([series_a , series_b] , ignore_index = True)
print(c)

0    1
1    2
2    3
3    4
dtype: int64 0    5
1    6
2    7
dtype: int64
0    1
1    2
2    3
3    4
0    5
1    6
2    7
dtype: int64
0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [52]:
import numpy as np
ser1 = pd.Series(list('abcd'))
ser2 = pd.Series(np.arange(4))
print(ser1)
#pd.concat([ser1, ser2], axis=1)
pd.concat([ser1, ser2], axis=0)
#pd.DataFrame({'col1': ser1, 'col2': ser2})

0    a
1    b
2    c
3    d
dtype: object

0    a
1    b
2    c
3    d
0    0
1    1
2    2
3    3
dtype: object